INSERT INTO users (username, password, type)  
VALUES
    ('user', 'password', 0),
    ('super', 'pass', 1);

INSERT INTO teams (name, location, division, win, lose)
VALUES  
    ('湖人', '西部', '太平洋分区', 0, 0),  
    ('快船', '西部', '太平洋分区', 0, 0),  
    ('勇士', '西部', '太平洋分区', 0, 0),  
    ('森林狼', '西部', '西北分区', 0, 0),  
    ('雷霆', '西部', '西北分区', 0, 0),  
    ('掘金', '西部', '西北分区', 0, 0),  
    ('国王', '西部', '太平洋分区', 0, 0),  
    ('独行侠', '西部', '西南分区', 0, 0),  
    ('鹈鹕', '西部', '西南分区', 0, 0),  
    ('太阳', '西部', '太平洋分区', 0, 0),  
    ('火箭', '西部', '西南分区', 0, 0),  
    ('爵士', '西部', '西北分区', 0, 0),  
    ('灰熊', '西部', '西南分区', 0, 0),  
    ('马刺', '西部', '西南分区', 0, 0),  
    ('开拓者', '西部', '西北分区', 0, 0),  
    ('凯尔特人', '东部', '大西洋分区', 0, 0),  
    ('雄鹿', '东部', '中部分区', 0, 0),  
    ('76人', '东部', '大西洋分区', 0, 0),  
    ('尼克斯', '东部', '大西洋分区', 0, 0),  
    ('热火', '东部', '东南分区', 0, 0),  
    ('魔术', '东部', '东南分区', 0, 0),  
    ('步行者', '东部', '中部分区', 0, 0),  
    ('骑士', '东部', '中部分区', 0, 0),  
    ('篮网', '东部', '大西洋分区', 0, 0),  
    ('公牛', '东部', '中部分区', 0, 0),  
    ('老鹰', '东部', '东南分区', 0, 0),  
    ('猛龙', '东部', '大西洋分区', 0, 0),  
    ('黄蜂', '东部', '东南分区', 0, 0),  
    ('奇才', '东部', '东南分区', 0, 0),  
    ('活塞', '东部', '中部分区', 0, 0);

INSERT INTO players (name, team, type)  
VALUES  
    ('詹姆斯哈登', '快船', 0),
    ('乔尔恩比德', '76人', 0),
    ('科尔', '勇士', 1);

INSERT INTO games (game_date, home_team, away_team, game_status, home_score, away_score)
VALUES
    ('2023-10-24', '湖人', '勇士', 1, 110, 95);

INSERT INTO player_honor (honor_name, award_date, recipient, recipient_id)
VALUES
    ('MVP', '2023-05-05', '恩比德', 2);

INSERT INTO team_honor (honor_name, award_date, recipient)
VALUES
    ('NBA总冠军', '2023-06-17', '掘金');  
